Revit 2026 API

# FormattedTextAsTextRange Method

---

Returns a TextRange object that represents the entire text.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public TextRange AsTextRange()
```
```vb
Public Function AsTextRange As TextRange
```
```cpp
public:
TextRange^ AsTextRange()
```
```fsharp
member AsTextRange : unit -> TextRange
```

#### Return Value

TextRange The TextRange object that represents the entire text.

This range includes a carriage return character ('\r') that is always present. As a result the range can never be an empty range.

#### Reference

FormattedText Class

Autodesk.Revit.DB Namespace